In [3]:
import numpy as np

In [5]:
sample_array=np.arange(1,20)
sample_array

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19])

In [6]:
np.sqrt(sample_array)

array([1.        , 1.41421356, 1.73205081, 2.        , 2.23606798,
       2.44948974, 2.64575131, 2.82842712, 3.        , 3.16227766,
       3.31662479, 3.46410162, 3.60555128, 3.74165739, 3.87298335,
       4.        , 4.12310563, 4.24264069, 4.35889894])

In [7]:
sample_array+sample_array

array([ 2,  4,  6,  8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34,
       36, 38])

In [9]:
np.log(sample_array)

array([0.        , 0.69314718, 1.09861229, 1.38629436, 1.60943791,
       1.79175947, 1.94591015, 2.07944154, 2.19722458, 2.30258509,
       2.39789527, 2.48490665, 2.56494936, 2.63905733, 2.7080502 ,
       2.77258872, 2.83321334, 2.89037176, 2.94443898])

In [10]:
np.max(sample_array)

19

In [12]:
np.argmax(sample_array)

18

In [13]:

np.square(sample_array)

array([  1,   4,   9,  16,  25,  36,  49,  64,  81, 100, 121, 144, 169,
       196, 225, 256, 289, 324, 361])

In [15]:
np.std(sample_array)

5.477225575051661

In [16]:
np.var(sample_array)

30.0

In [17]:
np.mean(sample_array)

10.0

In [18]:
array=np.random.randn(3,4)
array

array([[-0.21053805, -1.10224451,  0.75603906,  0.38877703],
       [ 0.13489108, -0.17992748, -0.72993664,  0.71866217],
       [ 0.53764429,  0.24330859, -1.18102785, -0.11714554]])

In [20]:
np.round(array,decimals=2)

array([[-0.21, -1.1 ,  0.76,  0.39],
       [ 0.13, -0.18, -0.73,  0.72],
       [ 0.54,  0.24, -1.18, -0.12]])

In [25]:
sport = np.array(['golf','cricket','football'])
np.unique(sport)

array(['cricket', 'football', 'golf'], dtype='<U8')

In [28]:

import pandas as pd
import numpy as np

df1=pd.DataFrame(np.random.rand(8,5),index='A B C D E F G H'.split(),columns='Score1 Score2 Score3 Score4 Score5'.split())

In [30]:
df1=pd.DataFrame(np.random.rand(8,5),index='A B C D E F G H'.split(),columns='Score1 Score2 Score3 Score4 Score5'.split())
df1

     Score1    Score2    Score3    Score4    Score5
A  0.585240  0.090139  0.554014  0.590333  0.089634
B  0.392410  0.204181  0.522209  0.729157  0.120553
C  0.262858  0.002999  0.028015  0.240164  0.303519
D  0.492411  0.464269  0.161255  0.250198  0.639471
E  0.440228  0.521689  0.409468  0.123783  0.191577
F  0.380589  0.056063  0.162187  0.897245  0.734655
G  0.427897  0.712470  0.386884  0.807324  0.680137
H  0.860132  0.030019  0.260365  0.178562  0.488238

In [31]:
df1["Score1"]

A    0.585240
B    0.392410
C    0.262858
D    0.492411
E    0.440228
F    0.380589
G    0.427897
H    0.860132
Name: Score1, dtype: float64

In [33]:
df1[["Score1","Score2","Score3"]]

     Score1    Score2    Score3
A  0.585240  0.090139  0.554014
B  0.392410  0.204181  0.522209
C  0.262858  0.002999  0.028015
D  0.492411  0.464269  0.161255
E  0.440228  0.521689  0.409468
F  0.380589  0.056063  0.162187
G  0.427897  0.712470  0.386884
H  0.860132  0.030019  0.260365

In [34]:
df1['Score6']=df1['Score1']+df1['Score2']
df1

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.585240  0.090139  0.554014  0.590333  0.089634  0.675379
B  0.392410  0.204181  0.522209  0.729157  0.120553  0.596591
C  0.262858  0.002999  0.028015  0.240164  0.303519  0.265857
D  0.492411  0.464269  0.161255  0.250198  0.639471  0.956680
E  0.440228  0.521689  0.409468  0.123783  0.191577  0.961917
F  0.380589  0.056063  0.162187  0.897245  0.734655  0.436652
G  0.427897  0.712470  0.386884  0.807324  0.680137  1.140367
H  0.860132  0.030019  0.260365  0.178562  0.488238  0.890152

In [37]:
df2={'ID':['101','102','103','107','176'],'Name':['John','Mercy','Akash','Kavin','Lally'],'Profit':[20,50,56,87,123]}
df=pd.DataFrame(df2)
df

    ID   Name  Profit
0  101   John      20
1  102  Mercy      50
2  103  Akash      56
3  107  Kavin      87
4  176  Lally     123

In [38]:
df["ID"]

0    101
1    102
2    103
3    107
4    176
Name: ID, dtype: object

In [40]:
df=df.drop("ID",axis=1)
df

    Name  Profit
0   John      20
1  Mercy      50
2  Akash      56
3  Kavin      87
4  Lally     123